IDEA StatiCa Open Model
IGeometryPart.Edges Property
Compatible with IDEA StatiCa Beta 21.0 - beta
 Lines of input edges on wall or beam
 Namespace: IdeaRS.OpenModel.Detail
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
List<ReferenceElement> Edges { get; set; }
Property Edges As List(Of ReferenceElement)
	Get
	Set
property List<ReferenceElement^>^ Edges {
	List<ReferenceElement^>^ get ();
	void set (List<ReferenceElement^>^ value);
}
Property Value
Type: List<ReferenceElement>
See Also
Reference
IGeometryPart Interface
IdeaRS.OpenModel.Detail Namespace